app/controllers/clients_controller.rb

SELECT `clients`.* FROM `clients` LIMIT 12 OFFSET 0
---
  def index
    @clients = Client.paginate :all, :page=>params[:page], :per_page=>session[:per_page]