app/controllers/hoppers_controller.rb

SELECT `hoppers`.* FROM `hoppers` ORDER BY number ASC
---
  def index
    @hoppers = Hopper.find_active