app/controllers/ingredients_controller.rb

SELECT COUNT(*) FROM `ingredients`
SELECT `ingredients`.* FROM `ingredients` LIMIT 12 OFFSET 0
---
  def index
    @ingredients = Ingredient.paginate :all, :page=>params[:page], :per_page=>session[:per_page]