app/controllers/orders_controller.rb

  def index
    @orders = Order.paginate :all, :page=>params[:page], :per_page=>session[:per_page]
---
SELECT `orders`.* FROM `orders` LIMIT 12 OFFSET 0