app/controllers/products_controller.rb

SELECT `products`.* FROM `products`
---
  def index
    @products = Product.find :all

INSERT INTO `products` (`code`, `created_at`, `name`, `updated_at`) VALUES ('123123', '2011-07-23 14:38:19', 'Hola', '2011-07-23 14:38:19')
---
  def create
    @product = Product.new params[:product]
    if @product.save