app/controllers/recipes_controller.rb

  def index
    @recipes = Recipe.paginate :all, :page=>params[:page], :per_page=>session[:per_page], :conditions => ['active = ?', true]
---
SELECT COUNT(*) FROM `recipes` WHERE (active = 1)
SELECT `recipes`.* FROM `recipes` WHERE (active = 1) LIMIT 12 OFFSET 0

  def show
    @recipe = Recipe.find(params[:id], :include=>'ingredient_recipe', :order=>'id desc')
---
SELECT `ingredient_recipes`.* FROM `ingredient_recipes` WHERE (`ingredient_recipes`.recipe_id = 2)
SELECT `recipes`.* FROM `recipes` WHERE `recipes`.`id` = 2 ORDER BY id desc LIMIT 1