app/controllers/users_controller.rb

  def index
    @users = User.paginate :all, :page=>params[:page], :per_page=>session[:per_page]
---
SELECT `users`.* FROM `users` LIMIT 12 OFFSET 0